### Kete fajll se kom formatu hala, ushtrimet,detyrat jane qysh i kem bo ne klase, vikendit e plotesoj me sqarime shtese edhe ushtrime shtese

# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section, we will go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

# What is Pandas?
Pandas is an open-source Python library used for data manipulation and analysis. It provides data structures like DataFrame and Series that allow for efficient handling of structured data. It is widely used in data science, machine learning, statistical analysis, and data cleaning.

## Key Features of Pandas
### Data Structures:
- **Series**: A one-dimensional array-like object that can hold any data type.
- **DataFrame**: A two-dimensional table of data with labeled axes (rows and columns), similar to an Excel spreadsheet or a SQL table.

### Data Cleaning and Preparation:
- Handling missing data.
- Filtering and transforming data.
- Merging and joining datasets.
- Reshaping data with pivot tables and group-by operations.

### Data Analysis:
Pandas provides powerful tools to explore and analyze data, including summary statistics, filtering, and aggregation.

### Data Input and Output:
Supports reading from and writing to various file formats like CSV, Excel, SQL databases, JSON, and HDF5.

### Time Series Data:
Built-in functionality for handling time-series data, including date parsing, resampling, and frequency conversion.

### Efficient Data Handling:
Pandas is designed for performance and can handle large datasets efficiently.

## Benefits of Using Pandas
- **Ease of Use**: Simplifies complex data manipulation tasks.
- **Integration with Other Libraries**: Works well with NumPy, Matplotlib, and Scikit-learn.
- **Data Cleaning**: Handles missing data, duplicates, and filtering.
- **Efficient Memory Management**: Optimized for performance.
- **Powerful Data Aggregation**: Functions like `groupby()`, `pivot_table()`, and `agg()`.
- **Time Series Support**: Built-in tools for handling time-based data.

## Why Use Pandas?
- **Simplifies Data Analysis Workflow**
- **Used in Real-World Applications**: Financial analysis, machine learning, and scientific research.
- **Industry Standard**: Popular and well-documented.

## Conclusion
Pandas is an indispensable tool for data manipulation and analysis in Python, offering an intuitive, powerful, and flexible way to handle structured data.

# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [1]:
# creating series from list and labels
import pandas as pd
import numpy as np

In [3]:
py_list = [1,2,3]
labels = ['a','b','c']

ser1 = pd.Series(data = py_list, index=labels, name='Test')
ser1

a    1
b    2
c    3
Name: Test, dtype: int64

In [7]:
# creating seris from numpy array

np.random.seed(100)

ser2 = pd.Series(data = np.random.randint(1,10,5), index= ['a','b','c','d','e'])
ser2

a    9
b    9
c    4
d    8
e    8
dtype: int32

In [ ]:
# creating series from dictionaries

In [6]:
d = {'name': 'Gezim', 'age':27}

pd.Series(d)

name    Gezim
age        27
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [13]:
# using index like in numpy
# using slice

print(ser2['a'])
print(ser2['a':'e'])

9
a    9
b    9
c    4
d    8
e    8
dtype: int32

In [ ]:
# using .iloc[]  and loc[]

In [14]:
ser2.iloc[2]

np.int32(4)

In [16]:
ser2['a']

np.int32(9)

### Attributes of a Series
index, values, dtype, shape

In [17]:
ser2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
ser2.values

array([9, 9, 4, 8, 8], dtype=int32)

### Performing Operations on a Series
- Applying math operation example. s+1
- Using apply() for custom functions

In [23]:
ser2= ser2 + 5

In [24]:
ser2

a    14
b    14
c     9
d    13
e    13
dtype: int32

In [25]:
ser2.apply(lambda x: x*2)

a    28
b    28
c    18
d    26
e    26
dtype: int64

### Checking for Missing Values
isna(), notna(), fillna()

In [26]:
ser4 = pd.Series(data = np.array([1, np.nan, 3, np.nan, 5, 6]) )

In [29]:
ser4.notna()

0     True
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [30]:
ser4.mean()

np.float64(3.75)

In [33]:
ser4.fillna(ser4.mean(), inplace=True)

In [34]:
ser4

0    1.00
1    3.75
2    3.00
3    3.75
4    5.00
5    6.00
dtype: float64

### Filtering in a Series
s[s>1]

In [35]:
condtion = ser4>4
print(condtion)

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [36]:
ser4[ condtion]

4    5.0
5    6.0
dtype: float64

# Pandas DataFrames
A DataFrame is a 2D labeled data structure in Pandas, similar to a table or an Excel spreadsheet. It consists of rows and columns, where:

- Rows have an index.
- Columns have labels.

## Creating dataframes
- using python list
- using numpy array
- using dictionary

In [39]:
pd.DataFrame(data = [[1,2,3],
                     [4,5,6],
                     [7,8,9]] , index=['a','b','c'], columns=['A','B','C'] )

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [40]:
d

{'name': 'Gezim', 'age': 27}

In [43]:
pd.DataFrame(data = d, index = ['a'])

    name  age
a  Gezim   27

##  Accessing Data in a DataFrame
- Selecting Columns  df[colname]
- Selecting rows and cols using    **df.loc[]  & df.iloc[]**
- Selecting spec. value **df.at[]  & dt.iat[]**

In [45]:
# pip install openpyxl
df = pd.read_excel('Transactions.xlsx')

In [46]:
df

    TransactionID Customer  Product     Category  Quantity  Price
0               1    Alice   Laptop  Electronics         1   1000
1               2      Bob    Phone  Electronics         2    500
2               3  Charlie   Tablet  Electronics         1    300
3               4    David    Shoes      Fashion         3     50
4               5     Emma  T-Shirt      Fashion         2     20
5               6    Alice    Phone  Electronics         1    500
6               7      Bob   Tablet  Electronics         2    300
7               8  Charlie   Laptop  Electronics         3   1000
8               9    David    Shoes      Fashion         1     50
9              10     Emma  T-Shirt      Fashion         2     20
10             11    Alice   Laptop  Electronics         1   1000
11             12      Bob    Shoes      Fashion         2     50
12             13  Charlie  T-Shirt      Fashion         3     20
13             14    David    Phone  Electronics         2    500
14             15     Emma   Tablet  Electronics         1    300
15             16    Alice    Shoes      Fashion         3     50
16             17      Bob  T-Shirt      Fashion         2     20
17             18  Charlie   Laptop  Electronics         1   1000
18             19    David    Phone  Electronics         2    500
19             20     Emma   Tablet  Electronics         3    300

In [49]:
df['Customer'].nunique()

5

In [50]:
df[['Customer', 'Product']]

   Customer  Product
0     Alice   Laptop
1       Bob    Phone
2   Charlie   Tablet
3     David    Shoes
4      Emma  T-Shirt
5     Alice    Phone
6       Bob   Tablet
7   Charlie   Laptop
8     David    Shoes
9      Emma  T-Shirt
10    Alice   Laptop
11      Bob    Shoes
12  Charlie  T-Shirt
13    David    Phone
14     Emma   Tablet
15    Alice    Shoes
16      Bob  T-Shirt
17  Charlie   Laptop
18    David    Phone
19     Emma   Tablet

In [56]:
df.iloc[3 , 1 ]

'David'

In [59]:
df.loc[3:, ['Customer', 'Product']]

   Customer  Product
3     David    Shoes
4      Emma  T-Shirt
5     Alice    Phone
6       Bob   Tablet
7   Charlie   Laptop
8     David    Shoes
9      Emma  T-Shirt
10    Alice   Laptop
11      Bob    Shoes
12  Charlie  T-Shirt
13    David    Phone
14     Emma   Tablet
15    Alice    Shoes
16      Bob  T-Shirt
17  Charlie   Laptop
18    David    Phone
19     Emma   Tablet

In [63]:
df.head()

   TransactionID Customer  Product     Category  Quantity  Price
0              1    Alice   Laptop  Electronics         1   1000
1              2      Bob    Phone  Electronics         2    500
2              3  Charlie   Tablet  Electronics         1    300
3              4    David    Shoes      Fashion         3     50
4              5     Emma  T-Shirt      Fashion         2     20

In [64]:
df[['TransactionID', 'Customer']]

    TransactionID Customer
0               1    Alice
1               2      Bob
2               3  Charlie
3               4    David
4               5     Emma
5               6    Alice
6               7      Bob
7               8  Charlie
8               9    David
9              10     Emma
10             11    Alice
11             12      Bob
12             13  Charlie
13             14    David
14             15     Emma
15             16    Alice
16             17      Bob
17             18  Charlie
18             19    David
19             20     Emma

In [65]:
df.iloc[1]

TransactionID              2
Customer                 Bob
Product                Phone
Category         Electronics
Quantity                   2
Price                    500
Name: 1, dtype: object

## Adding and removing columns
- df['new'] = ...
- df.drop(axis=1)

In [66]:
df.head(2)

   TransactionID Customer Product     Category  Quantity  Price
0              1    Alice  Laptop  Electronics         1   1000
1              2      Bob   Phone  Electronics         2    500

In [67]:
df['Total'] = df['Quantity'] * df['Price']

In [68]:
df.head()

   TransactionID Customer  Product     Category  Quantity  Price  Total
0              1    Alice   Laptop  Electronics         1   1000   1000
1              2      Bob    Phone  Electronics         2    500   1000
2              3  Charlie   Tablet  Electronics         1    300    300
3              4    David    Shoes      Fashion         3     50    150
4              5     Emma  T-Shirt      Fashion         2     20     40

In [72]:
df.drop('Total', axis = 1, inplace=False)

    TransactionID Customer  Product     Category  Quantity  Price
0               1    Alice   Laptop  Electronics         1   1000
1               2      Bob    Phone  Electronics         2    500
2               3  Charlie   Tablet  Electronics         1    300
3               4    David    Shoes      Fashion         3     50
4               5     Emma  T-Shirt      Fashion         2     20
5               6    Alice    Phone  Electronics         1    500
6               7      Bob   Tablet  Electronics         2    300
7               8  Charlie   Laptop  Electronics         3   1000
8               9    David    Shoes      Fashion         1     50
9              10     Emma  T-Shirt      Fashion         2     20
10             11    Alice   Laptop  Electronics         1   1000
11             12      Bob    Shoes      Fashion         2     50
12             13  Charlie  T-Shirt      Fashion         3     20
13             14    David    Phone  Electronics         2    500
14             15     Emma   Tablet  Electronics         1    300
15             16    Alice    Shoes      Fashion         3     50
16             17      Bob  T-Shirt      Fashion         2     20
17             18  Charlie   Laptop  Electronics         1   1000
18             19    David    Phone  Electronics         2    500
19             20     Emma   Tablet  Electronics         3    300

## Adding and Removing Rows
- df.append(new_row, ignore_index=True)
- df.drop(axis=0)

In [74]:
list(df.columns)

['TransactionID',
 'Customer',
 'Product',
 'Category',
 'Quantity',
 'Price',
 'Total']

In [87]:
new_row ={}
new_row['TransactionID'] = 10
new_row['Customer'] = 'Gezim'
new_row['Product'] = 'Mouse'
new_row['Category'] = 'Electronics'
new_row['Quantity'] = 1
new_row['Price'] = 70
new_row['Total'] = 70

In [88]:
new_row

{'TransactionID': 10,
 'Customer': 'Gezim',
 'Product': 'Mouse',
 'Category': 'Electronics',
 'Quantity': 1,
 'Price': 70,
 'Total': 70}

In [85]:
new_row

{'TransactionID': None,
 'Customer': None,
 'Product': None,
 'Category': None,
 'Quantity': None,
 'Price': None,
 'Total': None}

In [89]:
print(new_row)

{'TransactionID': 10, 'Customer': 'Gezim', 'Product': 'Mouse', 'Category': 'Electronics', 'Quantity': 1, 'Price': 70, 'Total': 70}

In [92]:
df._append(new_row, ignore_index=True)

    TransactionID Customer  Product     Category  Quantity  Price  Total
0               1    Alice   Laptop  Electronics         1   1000   1000
1               2      Bob    Phone  Electronics         2    500   1000
2               3  Charlie   Tablet  Electronics         1    300    300
3               4    David    Shoes      Fashion         3     50    150
4               5     Emma  T-Shirt      Fashion         2     20     40
5               6    Alice    Phone  Electronics         1    500    500
6               7      Bob   Tablet  Electronics         2    300    600
7               8  Charlie   Laptop  Electronics         3   1000   3000
8               9    David    Shoes      Fashion         1     50     50
9              10     Emma  T-Shirt      Fashion         2     20     40
10             11    Alice   Laptop  Electronics         1   1000   1000
11             12      Bob    Shoes      Fashion         2     50    100
12             13  Charlie  T-Shirt      Fashion         3     20     60
13             14    David    Phone  Electronics         2    500   1000
14             15     Emma   Tablet  Electronics         1    300    300
15             16    Alice    Shoes      Fashion         3     50    150
16             17      Bob  T-Shirt      Fashion         2     20     40
17             18  Charlie   Laptop  Electronics         1   1000   1000
18             19    David    Phone  Electronics         2    500   1000
19             20     Emma   Tablet  Electronics         3    300    900
20             10    Gezim    Mouse  Electronics         1     70     70

## DataFrame Attributes
shape, columns, index, dtypes

##  Filtering Data in a DataFrame
Conditional Selection

In [94]:
df

    TransactionID Customer  Product     Category  Quantity  Price  Total
0               1    Alice   Laptop  Electronics         1   1000   1000
1               2      Bob    Phone  Electronics         2    500   1000
2               3  Charlie   Tablet  Electronics         1    300    300
3               4    David    Shoes      Fashion         3     50    150
4               5     Emma  T-Shirt      Fashion         2     20     40
5               6    Alice    Phone  Electronics         1    500    500
6               7      Bob   Tablet  Electronics         2    300    600
7               8  Charlie   Laptop  Electronics         3   1000   3000
8               9    David    Shoes      Fashion         1     50     50
9              10     Emma  T-Shirt      Fashion         2     20     40
10             11    Alice   Laptop  Electronics         1   1000   1000
11             12      Bob    Shoes      Fashion         2     50    100
12             13  Charlie  T-Shirt      Fashion         3     20     60
13             14    David    Phone  Electronics         2    500   1000
14             15     Emma   Tablet  Electronics         1    300    300
15             16    Alice    Shoes      Fashion         3     50    150
16             17      Bob  T-Shirt      Fashion         2     20     40
17             18  Charlie   Laptop  Electronics         1   1000   1000
18             19    David    Phone  Electronics         2    500   1000
19             20     Emma   Tablet  Electronics         3    300    900

In [96]:
df[ (df['Total']  > 600)  & (df['Quantity'] >=2) ]

    TransactionID Customer Product     Category  Quantity  Price  Total
1               2      Bob   Phone  Electronics         2    500   1000
7               8  Charlie  Laptop  Electronics         3   1000   3000
13             14    David   Phone  Electronics         2    500   1000
18             19    David   Phone  Electronics         2    500   1000
19             20     Emma  Tablet  Electronics         3    300    900

In [104]:
df[ df['Product'] == 'Phone' ]['TransactionID'].count()

np.int64(4)

In [106]:
df_phone = df[ df['Product'] =='Phone'  ]

In [109]:
df_phone['Customer'].unique()

array(['Bob', 'Alice', 'David'], dtype=object)

## Sorting a dataframe
df.sort_values(column, asc, inplace)

In [114]:
df.sort_values(by='Total', ascending=True).head(1)

   TransactionID Customer  Product Category  Quantity  Price  Total
4              5     Emma  T-Shirt  Fashion         2     20     40

In [111]:
df

    TransactionID Customer  Product     Category  Quantity  Price  Total
0               1    Alice   Laptop  Electronics         1   1000   1000
1               2      Bob    Phone  Electronics         2    500   1000
2               3  Charlie   Tablet  Electronics         1    300    300
3               4    David    Shoes      Fashion         3     50    150
4               5     Emma  T-Shirt      Fashion         2     20     40
5               6    Alice    Phone  Electronics         1    500    500
6               7      Bob   Tablet  Electronics         2    300    600
7               8  Charlie   Laptop  Electronics         3   1000   3000
8               9    David    Shoes      Fashion         1     50     50
9              10     Emma  T-Shirt      Fashion         2     20     40
10             11    Alice   Laptop  Electronics         1   1000   1000
11             12      Bob    Shoes      Fashion         2     50    100
12             13  Charlie  T-Shirt      Fashion         3     20     60
13             14    David    Phone  Electronics         2    500   1000
14             15     Emma   Tablet  Electronics         1    300    300
15             16    Alice    Shoes      Fashion         3     50    150
16             17      Bob  T-Shirt      Fashion         2     20     40
17             18  Charlie   Laptop  Electronics         1   1000   1000
18             19    David    Phone  Electronics         2    500   1000
19             20     Emma   Tablet  Electronics         3    300    900

## Example 1:
- Task 1: Create an excel file containing students grades
- Task 2: Read that file using pandas
- Task 3: Add new index columns 'StudId'
- Task 4: Find the avg for each student and add as column
- Task 5: Find the avg for each subject and add as row
- Task 6: Select students with avg higher than 9.0

In [115]:
grades = pd.read_excel('grades.xlsx')

In [116]:
grades

   Student  Math  Py  Alg
0    Arber     7   8   10
1     Anda    10  10    9
2  Arijane    10   9   10

In [118]:
grades['StudId'] = list(range(1,4))

In [123]:
grades.set_index('Student', inplace=True)

In [133]:
grades.reset_index(inplace=True)

In [136]:
grades.set_index('StudId', inplace=True)

In [137]:
grades

        Student  Math  Py  Alg
StudId
1         Arber     7   8   10
2          Anda    10  10    9
3       Arijane    10   9   10

In [141]:
mean = grades[ ['Math','Py','Alg'] ].mean(axis = 1).round(2)

In [143]:
mean.name = 'Mean'

In [144]:
mean

StudId
1    8.33
2    9.67
3    9.67
Name: Mean, dtype: float64

In [145]:
grades['Mean'] = mean

In [146]:
grades

        Student  Math  Py  Alg  Mean
StudId
1         Arber     7   8   10  8.33
2          Anda    10  10    9  9.67
3       Arijane    10   9   10  9.67

In [149]:
mean_by_sub = grades[['Math','Py','Alg']].mean(axis = 0).round(2)

In [150]:
mean_by_sub

Math    9.00
Py      9.00
Alg     9.67
dtype: float64

In [157]:
grades = grades._append(mean_by_sub, ignore_index=True)

In [158]:
grades

   Student  Math    Py    Alg  Mean
0    Arber   7.0   8.0  10.00  8.33
1     Anda  10.0  10.0   9.00  9.67
2  Arijane  10.0   9.0  10.00  9.67
3      NaN   9.0   9.0   9.67   NaN

In [159]:
grades[ grades['Mean'] >9.0 ]

   Student  Math    Py   Alg  Mean
1     Anda  10.0  10.0   9.0  9.67
2  Arijane  10.0   9.0  10.0  9.67

In [161]:
grades.to_excel('Test.xlsx')

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:
- df.dropna()
- df.fillna(value = )
-

In [ ]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [1]:
# drop rows where there is a null value

In [2]:
# drop cols where there is a null value

In [3]:
# drop if there are more than 1 null values

In [ ]:
# fill null values of 'A' columns with mean values